sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
#include "lwip/opt.h"
#include "lwip/tcp.h"
#include "lwip/sys.h"
#include "gd32f30x.h"
#include "gd32f307c_eval.h"
#include "lwip/api.h"
#include "protocol_modbus.h"
#include "protocol_usart.h"
#include "app_rs485net.h"
#include "module_display.h"
#include "app_configure.h"
#include "app_format.h"
#include "module_audio.h"
#include "module_led.h"
#include "module_key.h"
#include "module_adc.h"
#include <string.h>
#include "systick.h"
#include <math.h>

#define RS485NET_TASK_PRIO  ( tskIDLE_PRIORITY + 5 )

extern struct config_data *p_configuration_data;

static char NettoStop = 0;

TaskHandle_t NetTaskHandle = NULL;
static uint32_t EVAL_COM[4] = {EVAL_COM0, EVAL_COM1, EVAL_COM3, EVAL_COM4};
void set_camera_status(void);

struct rs485net_timing_t
{
    uint32_t bus;
    uint16_t frequency;
    uint16_t address;
} deviceList[32];

void Delay_ms(uint16_t nms)
{
    uint16_t i, j;

    for(i = 0; i < nms * 1024; i++)
    {
        for(j = 0; j < nms * 1024; j++)
        {
            ;
        }
    }
}
uint8_t device_num = 0;

#if 0
void scan_dev(uint32_t usart_periph)
{
    unsigned char dev = 0;
    unsigned char rdata[8] = {0};
    int retry = 0;

    for (dev = 0; dev < 0xff; dev++)
    {
        while (usart_send(usart_periph, (uint8_t *)packed_modbus_rtu_frame(dev, 0x03, 0x0000, 0x0001), 8) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_send retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv_pre(usart_periph, 7) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv_pre retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv(usart_periph, rdata) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv retry over 100 times \r\n");
                break;
            }
        }
    }
}
#endif

uint8_t pir_status[4] = {0}, camera_status[4] = {0};
int led_status = 0;
int audio_num = 0;
uint8_t temp_count = 0;
uint8_t smoke_count = 0;
uint8_t gas_count = 0;
int start_record = 0;
int stop_record = 0;
uint8_t alarm_flag = 0;

void cancel_alarm()
{	
	led_status &= 0xdf;
	led_process_cmd(0, &led_status, 1);
	audio_process_cmd(0, 0, 0);
	audio_process_cmd(5, 0, 0);
	stop_record = 1;
	alarm_flag = 0;
}

void alarm_action(uint8_t n)
{
	start_record = 1;
	//报警灯
	led_status |= 0x30;
//	printf("led status %d\r\n", led_status);
	led_process_cmd(0, &led_status, 1);
//	vTaskDelay(pdMS_TO_TICKS(300));
	//蜂鸣器
	audio_process_cmd(4, 0, 0);
	//语音播放
	set_num(n);  //动火离人预警
	audio_process_cmd(1, 0, 0);
}

void set_alarm_data()
{
	alarmdata_report.data_type = 1;
	alarmdata_report.alarm_type.time_stamp = rtc_counter_get();
	alarmdata_report.alarm_param.time_stamp = alarmdata_report.alarm_type.time_stamp;
	alarmdata_report.serial_number.time_stamp = alarmdata_report.alarm_type.time_stamp;
	alarmdata_report.sensor_id.time_stamp = alarmdata_report.alarm_type.time_stamp;
	
	memcpy(alarmdata_report.serial_number.value, heartbeat_reportdata.heart_data.serial_number.value, 21);
	alarmdata_report.data_type = 1;
}

static void rs485net_task(void *arg)
{
	uint32_t NetNotifyValue = 0;
    uint32_t count = 0;
    uint32_t ltimestamp = 0, temp_warn_time = 0, temp_alarm_time = 0, left_ltimestamp = 0;
	uint32_t dhlr_warn_time = 0, dhlr_alarm_time = 0, gas_alarm_time = 0, smoke_alarm_time = 0;
    uint8_t index = 0;
    uint16_t retry = 0;
    unsigned char rdata[8] = {0};
    char display_buf[7];
    int key_status = 0;
	int adc_value[4] = {0};  //add by heyt 20240304
	
	uint16_t smoke_alarm_status = 0, gas_alarm_status = 0;
	uint16_t temp_warn_status = 0, temp_alarm_status = 0;
	uint8_t dhlr_warn_status = 0, dhlr_alarm_status = 0;
	uint8_t lr_status[4] = {0}, dh_status[4] = {0}, dhlr_status[4] = {0};
	uint8_t smoke_status[MAX_SENSOR_NUM] = {0};
	uint8_t gas_status[MAX_SENSOR_NUM] = {0};
	uint8_t temp_status[MAX_SENSOR_NUM] = {0};
	uint32_t smoke_alarm_ltimestamp = 0, gas_alarm_ltimestamp = 0;
	uint32_t temp_warn_ltimestamp = 0, temp_alarm_ltimestamp = 0;
	uint32_t dhlr_warn_ltimestamp = 0;
	
	uint8_t smoke_num = 0;
	uint8_t gas_num = 0;
	uint8_t temp_num = 0;
	uint8_t pir_num = 0;
	
    memcpy(heartbeat_reportdata.heart_data.serial_number.value, p_configuration_data->host_serial, sizeof(p_configuration_data->host_serial));
    ltimestamp = rtc_counter_get();
    while (1)
    {
		if (xTaskNotifyWait(0UL, 0xffffffffUL, &NetNotifyValue, portMAX_DELAY) == pdTRUE)
        {
            //printf("received notify value %u\r\n", NetNotifyValue);
        }
		while(!NettoStop)
		{
	        // get key status
	        key_status = get_key_value();
	        printf("\r\nkeybitmap:%02x\tcount:%d\r\n", key_status, count);
//			printf("gas : %d\t smoke: %d\r\n", p_configuration_data->gas_th, p_configuration_data->smoke_th);
	        if ((key_status & 0x01) == 0)
	        {	
				cancel_alarm();
				//add by heyt 20240306 start ----------------------
				smoke_alarm_status = 0;
				gas_alarm_status = 0;
				temp_warn_status = 0;
				temp_alarm_status = 0;
				dhlr_warn_status = 0;
				dhlr_alarm_status = 0;
				memset(pir_status, 0, 4);
				memset(camera_status, 0, 4);
				memset(dhlr_status, 0, 4);
				memset(temp_status, 0, MAX_SENSOR_NUM);
				memset(smoke_status, 0, MAX_SENSOR_NUM);
				memset(gas_status, 0, MAX_SENSOR_NUM);
				//add by heyt 20240306 end ------------------------
	        }
        
	        memset(rdata, 0x00, 8);
			smoke_num = 0; gas_num = 0; temp_num = 0, pir_num = 0;
	        heartbeat_reportdata.heart_data.serial_number.time_stamp = rtc_counter_get();
	//        printf("timestamp: %d\r\n", heartbeat_reportdata.heart_data.serial_number.time_stamp);
	        for (index = 0; index < device_num; index++)
	        {
	            if ((count % deviceList[index].frequency) == 0)
	            {
	//				printf("device num %d\r\n", index);
	                while (usart_send(deviceList[index].bus, (uint8_t *)packed_modbus_rtu_frame(deviceList[index].address, 0x03, 0x0000, 0x0001), 8) < 0)
	                {
	//                    retry++;
	//                    vTaskDelay(pdMS_TO_TICKS(10));
	//                    if (retry > 100)
	//                    {
	//                        retry = 0;
	//                        printf("usart_send retry over 100 times \r\n");
	//                        break;
	//                    }
	                }

	                // delay 1ms to make sure send finish
	                vTaskDelay(pdMS_TO_TICKS(1)); // 不能改 
				
