sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
	                usart_recv_clear(deviceList[index].bus);

	                while (usart_recv_pre(deviceList[index].bus, 7) < 0)
	                {
	                    retry++;
	                    vTaskDelay(pdMS_TO_TICKS(10));
	                    if (retry > 100)
	                    {
	                        retry = 0;
	                        printf("usart_recv_pre retry over 100 times \r\n");
	                        break;
	                    }
	                }
				
	                while (usart_recv(deviceList[index].bus, rdata) < 0)
	                {
						if(index == 0){
							break;
						}
	                    retry++;
	                    vTaskDelay(pdMS_TO_TICKS(10));
	                    if (retry > 100)
	                    {
	                        printf("usart_recv %d retry over 100 times \r\n", index);
	                        break;
	                    }
	                }

	                if (retry > 100)
	                {
	                    retry = 0;
	                }
	                else
	                {
	                    if (parse_modbus_rtu_frame((ModbusRtuFrameAck *)rdata) == 0)
	                    {
	                        led_status |= 0x08;
	                        led_process_cmd(0, &led_status,1);
	//                        printf("slave_address:%02x, function_code:%02x, byte_count:%02x, ", ((ModbusRtuFrameAck *)rdata)->slave_address, ((ModbusRtuFrameAck *)rdata)->function_code, ((ModbusRtuFrameAck *)rdata)->byte_count);
	//                        printf("data[0]:%02x, data[1]:%02x\r\n", ((ModbusRtuFrameAck *)rdata)->data[0], ((ModbusRtuFrameAck *)rdata)->data[1]);
	//						printf("warn delay : %d\twarn time : %d\talarm delay : %d\talarm time : %d\r\n", 
	//							p_configuration_data->warn_delay, p_configuration_data->warn_time, p_configuration_data->alarm_delay, p_configuration_data->alarm_time);
	                        switch (((ModbusRtuFrameAck *)rdata)->slave_address >> 6)
	                        {
	                        case 0x00: // smoker
	                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
	                            // TODO:display smoker value
	                            lcd_display(4, 5, display_buf);

	                            // TODO: upload smoker sensor's value
	                            heartbeat_reportdata.heart_data.smoke_detector.time_stamp = rtc_counter_get();
	                            sprintf(heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_num].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
	                            heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_num].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];

	                            // TODO: compare with alram th
	                            printf("smoker_sensor[%d] value: %d\r\n", smoke_num, heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_num].param);
							
	                            if ((key_status&0x01) && (heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_num].param > p_configuration_data->smoke_th * 100))//2000))
	                            {
									if(smoke_alarm_status == 0 && alarm_flag == 0)
//										&& gas_alarm_status == 0 && temp_alarm_status == 0 && dhlr_alarm_status == 0)
									{
										alarm_flag = 1;
										smoke_alarm_status = smoke_num + 1;
										smoke_alarm_ltimestamp = rtc_counter_get();
										smoke_status[smoke_num] = 1;
									}
	                            }else{
									smoke_status[smoke_num] = 0;
								}
								smoke_num++;
	                            break;
							
	                        case 0x01: // gas
	                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
	                            // TODO:display gas value
	                            lcd_display(3, 5, display_buf);
	                            // TODO: compare with alram th
	                            // TODO: upload smoker sensor's value
	                            heartbeat_reportdata.heart_data.gas_detector.time_stamp = rtc_counter_get();
	                            sprintf(heartbeat_reportdata.heart_data.gas_detector.sensors[gas_num].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
	                            heartbeat_reportdata.heart_data.gas_detector.sensors[gas_num].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];
								printf("gas_sensor[%d] value %d\r\n", gas_num, heartbeat_reportdata.heart_data.gas_detector.sensors[gas_num].param);
	//							printf("gas value %d\r\n",  heartbeat_reportdata.heart_data.gas_detector.sensors[index].param);
						
								if ((key_status&0x01) && (heartbeat_reportdata.heart_data.gas_detector.sensors[gas_num].param > p_configuration_data->gas_th * 100))//2000))
	                            {
									if(gas_alarm_status == 0 && alarm_flag == 0)
//										&& smoke_alarm_status == 0 && temp_alarm_status == 0 && dhlr_alarm_status == 0)
									{
										alarm_flag = 1;
										gas_alarm_status = gas_num + 1;
										gas_alarm_ltimestamp = rtc_counter_get();
										gas_status[gas_num] = 1;
									}
	                            }else{
									gas_status[gas_num] = 0;
								}
								gas_num ++;
	                            break;
							
	                        case 0x02: // tempeture
	                            heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param = ((ModbusRtuFrameAck *)rdata)->data[0] << 8 | ((ModbusRtuFrameAck *)rdata)->data[1];
                            
	                            sprintf(display_buf, " %03d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param / 10) % 1000, heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param % 10);
	                            // TODO:display tempeture value
	                            lcd_display(2, 4, display_buf);

	                            // TODO: upload tempeture sensor's value
	                            heartbeat_reportdata.heart_data.temperature.time_stamp = rtc_counter_get();
	                            sprintf(heartbeat_reportdata.heart_data.temperature.sensors[temp_num].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
	                            // TODO: compare with alram th
	                        	printf("temperature_sensor[%d]  value %d \r\n", temp_num, heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param);
								// edit by heyt 20240305 start ------------
								//温度大于报警温度 不管有无人 报警
								if ((key_status&0x01) && ((heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param / 10) > (p_configuration_data->alarm_temp - p_configuration_data->temp_calibrate)))//200))
	                            {
									if(temp_alarm_status == 0 && alarm_flag == 0)
//										&& dhlr_alarm_status == 0 && smoke_alarm_status == 0 && gas_alarm_status == 0 )
									{
										alarm_flag = 1;
										temp_alarm_status = temp_num + 1;
									
