sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
										if(temp_warn_status != 0){
											temp_warn_status = 0;
											temp_alarm_ltimestamp = temp_warn_ltimestamp;
										}else{
											temp_alarm_ltimestamp = rtc_counter_get();
										}
										temp_status[temp_num] = 1;
									}
	                            }
								else if((key_status&0x01) && temp_alarm_status == 0 
									&& ((heartbeat_reportdata.heart_data.temperature.sensors[temp_num].param / 10) > (p_configuration_data->warn_temp - p_configuration_data->temp_calibrate)))//100))
	                            {
									if(temp_warn_status == 0 && alarm_flag == 0){
										alarm_flag = 1;
										temp_warn_status = temp_num + 1;
										temp_warn_ltimestamp = rtc_counter_get();
										temp_status[temp_num] = 2;
									}
	                            }
								else{
									temp_status[temp_num] = 0;
								}
								temp_num++;
								break;
								// edit by heyt 20240305 end ------------
	                        case 0x03: // pir
	                            // TODO:display pir value
								sprintf(heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
								if((((ModbusRtuFrameAck *)rdata)->slave_address & 0x0f) == p_configuration_data->channel0.pir_id){
									pir_num = 0;
								}
								else if((((ModbusRtuFrameAck *)rdata)->slave_address & 0x0f) == p_configuration_data->channel1.pir_id){
									pir_num = 1;
								}
								else if((((ModbusRtuFrameAck *)rdata)->slave_address & 0x0f) == p_configuration_data->channel2.pir_id){
									pir_num = 2;
								}
								else if((((ModbusRtuFrameAck *)rdata)->slave_address & 0x0f) == p_configuration_data->channel3.pir_id){
									pir_num = 3;
								}
	                            if (((ModbusRtuFrameAck *)rdata)->data[1] == 1)
	                            { // 有人，清空离人时间
	                                heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].status = ((ModbusRtuFrameAck *)rdata)->data[1];;
	                                heartbeat_reportdata.heart_data.body_detector.time_stamp = 0;
	                                sprintf(display_buf, " 000");
	                                lcd_display(1, 5, display_buf);
									pir_status[pir_num] = 0;
	                            }
	                            else
	                            { // 没人，且上次也没人
	                                if (heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].status == ((ModbusRtuFrameAck *)rdata)->data[1])
	                                {
	                                    heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp = heartbeat_reportdata.heart_data.body_detector.time_stamp - left_ltimestamp;
										heartbeat_reportdata.heart_data.body_detector.leave_time = heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp;
	                                }
	                                else // 没人，上次有人
	                                {	
	                                    // person left detected, save timestamp
	                                    left_ltimestamp = rtc_counter_get();
	                                }
									pir_status[pir_num] = 1;
									heartbeat_reportdata.heart_data.body_detector.status = pir_num + 1;
	                                heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].status = ((ModbusRtuFrameAck *)rdata)->data[1];
	                                heartbeat_reportdata.heart_data.body_detector.time_stamp = rtc_counter_get();
	                            }
								printf("pir_sensor[%d] status %d\r\n", pir_num, heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].status);
								// 显示时间
	                            if ((heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp > 0) && (heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp < 1000))
	                            {
	                                sprintf(display_buf, " %03d", heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp);
	                                lcd_display(1, 5, display_buf);
									printf("left time %d\r\n", heartbeat_reportdata.heart_data.body_detector.sensors[pir_num].leave_time_stamp);
	                            }
	                            break;
	                        default:
	                            break;
	                        }

	                    }
	                }
	//                printf("%02x %02x %02x %02x %02x %02x %02x %02x\r\n", rdata[0], rdata[1], rdata[2], rdata[3], rdata[4], rdata[5], rdata[6], rdata[7]);
	            }
	            vTaskDelay(pdMS_TO_TICKS(200));
	        }
			temp_count = temp_num;
			gas_count = gas_num;
			smoke_count = smoke_num;
		
	        count++;
			if(count == 1000){
				count = 0;
			}
			

/*****************************传感器状态判断**************************************/
			/* 摄像头，pir，互感绑定 */
			set_camera_status();
			
			// TODO:ADC read  动火状态
			adc_process_cmd(0, adc_value, 4);
			for(index = 0; index < 4; index ++){
				if(adc_value[index] > p_configuration_data->hot_work_threshold){
					dh_status[index] = 1;
					heartbeat_reportdata.heart_data.fire_detector.status = index + 1;
					heartbeat_reportdata.heart_data.fire_detector.time_stamp = rtc_counter_get();
				}else{
					dh_status[index] = 0;
				}
				if(pir_status[index] == 1 && camera_status[index] == 1){
					lr_status[index] = 1;
				}else{
					lr_status[index] = 0;
				}
			}
			
			for(index = 0; index < 4; index++){
				if(dh_status[index] == 1  //动火
				&& lr_status[index] == 1 //离人
				&& alarm_flag == 0){  
					dhlr_status[index] = 1;
						 alarm_flag = 1;
					dhlr_warn_status = index + 1;
					dhlr_warn_ltimestamp = rtc_counter_get();
				}else{
					dhlr_status[index] = 0;
				}
			}	
				
//		printf("warn delay %d warn time %d alarm delay %d alarm time %d\r\n", p_configuration_data->warn_delay,
//		p_configuration_data->warn_time, p_configuration_data->alarm_delay, p_configuration_data->alarm_time);
//		alarm_action(0);

			/* 判断动火状态 */
			if(heartbeat_reportdata.heart_data.fire_detector.status != 0){
				for(index = 0; index < 4; index ++){
					if(dh_status[index] != 0){
						break;
					}
				}
				if(index == 4){
					heartbeat_reportdata.heart_data.fire_detector.status = 0;
				}
			}
			/* 判断离人状态 */
			if(heartbeat_reportdata.heart_data.body_detector.status != 0){
				for(index = 0; index < 4; index ++){
					if(lr_status[index] != 0){
						break;
					}
				}
				if(index == 4){
					heartbeat_reportdata.heart_data.body_detector.status = 0;
					heartbeat_reportdata.heart_data.body_detector.leave_time = 0;
				}
			}
			/* 判断动火离人报警 */
			if(dhlr_alarm_status != 0){
				for(index = 0; index < 4; index ++){
					if(dhlr_status[index] != 0){
						break;
					}
				}
				if(index == 4){
					dhlr_alarm_status = 0;
				}
			}
			/* 判断动火离人预警 */
			if(dhlr_warn_status != 0 && dhlr_alarm_status == 0){
				for(index = 0; index < 4; index ++){
					if(dhlr_status[index] != 0){
						break;
					}
				}
				if(index == 4){
					dhlr_warn_status = 0;
					clearalarm();
				}
			}
			/* 判断燃气状态 */
			if(gas_alarm_status != 0){
				for(index = 0; index < gas_num; index ++){
					if(gas_status[index] == 1){
						break;
					}
				}
				if(index == gas_num){
					gas_alarm_status = 0;
				}
			}	
			/* 判断烟雾状态 */
			if(smoke_alarm_status != 0){
				for(index = 0; index < smoke_num; index ++){
					if(smoke_status[index] == 1){
						break;
					}
				}
				if(index == smoke_num){
					smoke_alarm_status = 0;
				}
			}
		
