sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
			/* 判断温度状态 */
			if(temp_alarm_status != 0){
				for(index = 0; index < temp_num; index ++){
					if(temp_status[index] != 0){
						break;
					}
				}
				if(index == temp_num){
					temp_alarm_status = 0;
				}
			}
			/* 判断高温预警 */
			if(temp_warn_status != 0 && temp_alarm_status == 0){
				for(index = 0; index < temp_num; index ++){
					if(temp_status[index] == 1){
						temp_alarm_status = temp_warn_status;
						temp_warn_status = 0;
						break;
					}
					if(temp_status[index] != 0){
						break;
					}
				}
				if(index == temp_num){
					temp_warn_status = 0;
					clearalarm();
				}
			}


/****************************************************************************************/
			if(dhlr_warn_status == 1 && dhlr_alarm_status == 0 && (key_status & 0x01))//动火预警
			{	//时间大于预警延迟//无动火预警行为
				ltimestamp = rtc_counter_get();
				if((dhlr_warn_time == 0) && (ltimestamp - dhlr_warn_ltimestamp > p_configuration_data->warn_delay))
				{	
					printf("dhlr warn > delay action\r\n");
					//记录预警时间
					dhlr_warn_time = rtc_counter_get();
					//上报预警信息
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_WARN");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.body_detector.sensors[dhlr_warn_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d", ltimestamp - dhlr_warn_ltimestamp);
					set_alarm_data();
					//报警
					alarm_action(0);
				}
				//有动火预警行为// 动火预警时间 大于 预警时长 取消预警
				ltimestamp = rtc_counter_get();
				if((dhlr_warn_time != 0) && (dhlr_alarm_time == 0) && 
					(ltimestamp - dhlr_warn_time > p_configuration_data->warn_time))
				{  
					printf("dhlr warn cancel action\r\n");
					cancel_alarm();
					clearalarm();
				}
			
				// 动火时间 大于 报警延迟 报警
				ltimestamp = rtc_counter_get();
				if((dhlr_warn_time != 0) && (dhlr_alarm_time == 0) && 
					(ltimestamp - dhlr_warn_time > p_configuration_data->alarm_delay))
				{
					printf("dhlr warn -> alarm action\r\n");
					//进入动火离人报警状态
					dhlr_alarm_status = dhlr_warn_status;
					dhlr_alarm_time = rtc_counter_get();
					//退出预警状态
					dhlr_warn_status = 0;
					dhlr_warn_time = 0;
					// 报警
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_ALARM");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.body_detector.sensors[dhlr_alarm_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d", ltimestamp - dhlr_warn_time);
					set_alarm_data();
					alarm_action(1);
				}
			}
			else if(dhlr_alarm_status != 0 && (key_status & 0x01)) // 动火报警
			{	
				// 断电断气
				ltimestamp = rtc_counter_get();
				if((dhlr_alarm_time != 0) && (ltimestamp - dhlr_alarm_time > p_configuration_data->break_delay))
				{
					key_process_cmd(0, 0, 0); //断电断气
				}
				// 动火报警时间大于报警时长
				ltimestamp = rtc_counter_get();
				if((dhlr_alarm_time != 0) && (ltimestamp - dhlr_alarm_time > p_configuration_data->alarm_time))
				{
					printf("dhlr alarm cancel \r\n");
					cancel_alarm(); //取消报警
					clearalarm();
				
					dhlr_alarm_status = 0;
					dhlr_alarm_time = 0;
					dhlr_warn_status = 0;
					dhlr_warn_time = 0;
					memset(dhlr_status, 0, 4);
				}
			}  // end  if(dhlr_alarm_status == 1)

				/* 高温预警 */
			if(temp_warn_status != 0 && temp_alarm_status == 0 && (key_status & 0x01))
			{
				//温度预警时间大于预警延迟 
				ltimestamp = rtc_counter_get();
				if((temp_warn_time == 0) && (ltimestamp - temp_warn_ltimestamp > p_configuration_data->warn_delay))
				{  
					printf("temp warn > delay \r\n");
					temp_warn_time = rtc_counter_get();
					//预警
					sprintf(alarmdata_report.alarm_type.value, "%s", "OIL_TEMP_WARN");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.temperature.sensors[temp_warn_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[temp_warn_status - 1].param / 10) % 1000, 
					heartbeat_reportdata.heart_data.temperature.sensors[temp_warn_status - 1].param % 10);
					set_alarm_data();
					alarm_action(2);
				}
				// 有温度预警行为//温度预警时间大于预警时长
				ltimestamp = rtc_counter_get();
				if((temp_warn_time != 0) && (ltimestamp - temp_warn_time > p_configuration_data->warn_time))
				{
					printf("cancel temp warn \r\n");
					cancel_alarm();
					clearalarm();
				}
			
				//温度预警时间大于报警延迟
				ltimestamp = rtc_counter_get();
				if((temp_warn_time != 0) && (ltimestamp - temp_warn_time > p_configuration_data->alarm_delay))
				{	
					printf("temp warn -> alarm action \r\n");
					//进入高温报警状态
					temp_alarm_status = temp_warn_status;
					temp_alarm_time = rtc_counter_get();
					//退出预警状态
					temp_warn_status = 0;
					temp_warn_time = 0;
					//报警
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].param / 10) % 1000, 
						heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].param % 10);
					set_alarm_data();
					alarm_action(3);
				}
			}
			
			/* 高温报警 */
			if(temp_alarm_status != 0 && (key_status & 0x01))
			{	//高温报警时间大于报警延迟//无报警行为
				ltimestamp = rtc_counter_get();
				if((temp_alarm_time == 0) && (ltimestamp - temp_alarm_ltimestamp > p_configuration_data->alarm_delay))
				{
					printf("temp alarm action start \r\n");
					temp_alarm_time = rtc_counter_get();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].param / 10) % 1000, 
						heartbeat_reportdata.heart_data.temperature.sensors[temp_alarm_status - 1].param % 10);
					set_alarm_data();
					alarm_action(3);
				}
				// 断电断气
				ltimestamp = rtc_counter_get();
				if((temp_alarm_time != 0) && (ltimestamp - temp_alarm_time > p_configuration_data->break_delay))
				{
					printf("--------------------断电断气---------------------\r\n");
					key_process_cmd(0, 0, 0); //断电断气
				}
				//报警时间大于报警时长
				ltimestamp = rtc_counter_get();
				if((temp_alarm_time != 0) && (ltimestamp - temp_alarm_time > p_configuration_data->alarm_time))
				{
					printf("cancel temp alarm action\r\n");
					cancel_alarm();
					clearalarm();
					temp_alarm_status = 0;
					temp_alarm_time = 0;
					temp_warn_status = 0;
					temp_warn_time = 0;
					memset(temp_status, 0, MAX_SENSOR_NUM);
				}
			}
		
			/* 燃气 报警 */
			if(gas_alarm_status != 0 && (key_status & 0x01))
			{
				//报警时间大于报警延迟//没有报警行为
				ltimestamp = rtc_counter_get();
				if((gas_alarm_time == 0) && (ltimestamp - gas_alarm_ltimestamp > p_configuration_data->alarm_delay))
				{
					printf("gas alarm action\r\n");
					gas_alarm_time = rtc_counter_get();
				
					sprintf(alarmdata_report.alarm_type.value, "%s", "GAS_ALARM");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.gas_detector.sensors[gas_alarm_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d.%d", heartbeat_reportdata.heart_data.gas_detector.sensors[gas_alarm_status - 1].param / 100, 
							heartbeat_reportdata.heart_data.gas_detector.sensors[gas_alarm_status - 1].param % 100);
					set_alarm_data();
					alarm_action(4);
				}	
				// 断电断气
				ltimestamp = rtc_counter_get();
				if((gas_alarm_time != 0) && (ltimestamp - gas_alarm_time > p_configuration_data->break_delay))
				{
					key_process_cmd(0, 0, 0); //断电断气
				}
				//报警时间大于报警时长
				ltimestamp = rtc_counter_get();
				if((gas_alarm_time != 0) && (ltimestamp - gas_alarm_time > p_configuration_data->alarm_time))
				{
					printf("cancel gas alarm action\r\n");
					cancel_alarm();
					clearalarm();

					gas_alarm_status = 0;
					gas_alarm_time = 0;
					memset(gas_status, 0, MAX_SENSOR_NUM);
				}
			}
		
			/* 烟雾报警 */
			if(smoke_alarm_status != 0 && (key_status & 0x01))
			{
				//报警时间大于报警延迟//没有报警行为
				ltimestamp = rtc_counter_get();
				if((smoke_alarm_time == 0) && (ltimestamp - smoke_alarm_ltimestamp > p_configuration_data->alarm_delay))
				{
					printf("smoke alarm action\r\n");
					smoke_alarm_time = rtc_counter_get();
				
					sprintf(alarmdata_report.alarm_type.value, "%s", "SMOKE_ALARM");
					sprintf(alarmdata_report.sensor_id.value, "%s", heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_alarm_status - 1].device_id);
					sprintf(alarmdata_report.alarm_param.value, "%d.%d", heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_alarm_status - 1].param / 100, 
							heartbeat_reportdata.heart_data.smoke_detector.sensors[smoke_alarm_status - 1].param % 100);
					set_alarm_data();
					alarm_action(5);
				}
				// 断电断气
				ltimestamp = rtc_counter_get();
				if((smoke_alarm_time != 0) && (ltimestamp - smoke_alarm_time > p_configuration_data->break_delay))
				{
					key_process_cmd(0, 0, 0); //断电断气
				}
				//报警时间大于报警时长
				ltimestamp = rtc_counter_get();
				if((smoke_alarm_time != 0) && (ltimestamp - smoke_alarm_time > p_configuration_data->alarm_time))
				{
					printf("cancel smoke alarm action\r\n");
					cancel_alarm();
					clearalarm();
					smoke_alarm_status = 0;
					smoke_alarm_time = 0;
					memset(smoke_status, 0, MAX_SENSOR_NUM);
				}
			}
			vTaskDelay(pdMS_TO_TICKS(100));
			//add by heyt 20240306 end ----------------------
		}
    }
}


