sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
void rs485net_task_init(void)
{

	uint8_t i = 0, j = 0;
	show_data(p_configuration_data);
	printf("------------------- rs485net_task_init start ----------------\r\n");
#if 1	
	deviceList[device_num].bus = EVAL_COM0;
    deviceList[device_num].address = 0x002F;
    deviceList[device_num].frequency = 0x01;
	device_num++;
//    deviceList[device_num].bus = EVAL_COM3;
//    deviceList[device_num].address = 0x00c3;
//    deviceList[device_num].frequency = 0x01;
//	device_num++;
//    deviceList[device_num].bus = EVAL_COM4;
//    deviceList[device_num].address = 0x0041;
//    deviceList[device_num].frequency = 0x01;
//	device_num++;
//    deviceList[device_num].bus = EVAL_COM4;
//    deviceList[device_num].address = 0x0082;
//    deviceList[device_num].frequency = 0x01;
//	device_num++;
#endif
#if 1
	for(i = 0; i < 4; i++)
	{
		/* 解析烟雾传感器端口地址 */
		if(p_configuration_data->smoke_port[i] != 0)
		{
			printf("---------- smoke ----------\r\n");
			for(j = 0; j < 32; j ++){
				if(p_configuration_data->smoke_port[i] & (0x01 << j)){
					
					deviceList[device_num].bus = EVAL_COM[i];
					deviceList[device_num].address = j + 0x00;
					deviceList[device_num].frequency = 1;
					printf("device[%d] bus %x\tsmoke port %d\taddr %X\r\n", device_num, deviceList[device_num].bus, i, deviceList[device_num].address);
					device_num ++;
				}
			}
		}
		/* 解析燃气传感器端口地址 */
		if(p_configuration_data->gas_port[i] != 0)
		{
			printf("---------- gas ----------\r\n");
			for(j = 0; j < 32; j ++){
				if(p_configuration_data->gas_port[i] & (0x01 << j)){
					deviceList[device_num].bus = EVAL_COM[i];
					deviceList[device_num].address = j + 0x40;
					deviceList[device_num].frequency = 1;
					printf("device[%d] bus %x\tgas port %d\taddr %X\r\n", device_num, deviceList[device_num].bus, i, deviceList[device_num].address);
					device_num++;
				}
			}
		}
		/* 解析温度传感器端口地址 */
		if(p_configuration_data->temp_port[i] != 0)
		{
			printf("---------- temp ----------\r\n");
			for(j = 0; j < 32; j ++){
				if(p_configuration_data->temp_port[i] & (0x01 << j)){
					deviceList[device_num].bus = EVAL_COM[i];
					deviceList[device_num].address = j + 0x80;
					deviceList[device_num].frequency = 1;
					printf("device[%d] bus %x\ttemp port %d\taddr %X\r\n", device_num, deviceList[device_num].bus, i, deviceList[device_num].address);
					device_num ++;
				}
			}
		}
		/* 解析pir端口地址 */
		if(p_configuration_data->pir_port[i] != 0)
		{
			printf("---------- pir ----------\r\n");
			for(j = 0; j < 32; j ++){
				if(p_configuration_data->pir_port[i] & (0x01 << j)){
					deviceList[device_num].bus = EVAL_COM[i];
					deviceList[device_num].address = j + 0xC0;
					deviceList[device_num].frequency = 1;
					printf("device[%d] bus %x\tpir port %d\taddr %X\r\n", device_num, deviceList[device_num].bus, i, deviceList[device_num].address);
					device_num++;
				}
			}
		}
	}
#endif
    xTaskCreate(rs485net_task, "RS485NET", DEFAULT_THREAD_STACKSIZE * 4, NULL, RS485NET_TASK_PRIO, &NetTaskHandle);
}

void rs485net_task_start(void)
{
	uint32_t ulValueToSend = 100UL;
    NettoStop = 0;
    xTaskNotify(NetTaskHandle, ulValueToSend, eSetValueWithOverwrite);
}

void rs485net_task_stop(void)
{
	if (NettoStop == 0)
    {
        NettoStop = 1;
    }
}

int uart0_get_tmperature_data()
{
	int i = 0;
    uint8_t Asdata[4] = {0};
    uint8_t Brdata[4] = {0};
	
	
	rs485net_task_stop();    


	/* 初始化发送数据 */
	for (i = 0; i < 4; i++)
	{
		Asdata[i] = 0x30 + i;
	}
	

	while(usart_recv_pre(EVAL_COM1, 4) < 0);
	while(usart_send(EVAL_COM0, (uint8_t *) Asdata, 4) < 0);	
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Asend_data[%d]: %d\n", i, Asdata[i]);
//	}
	
	while (usart_recv(EVAL_COM1, Brdata) < 0)
	{
		;
	}
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Brdata[%d]: %d\n", i, Brdata[i]);
//	}
	
	
	//if(memcmp(Asdata, Brdata, sizeof(Asdata)) == 0)
	if(Brdata[0] != 0 || Brdata[1] != 0 || Brdata[2] != 0 || Brdata[3] != 0)
	{
		//printf("data and rdata are equal\n");
		return 1;
	} 
	else{
		//printf("data and rdata are not equal\n");
		return 0;
	}
	
	//printf("test pass \r\n");
	//rs485net_task_start();
    		
}

int uart1_get_tmperature_data()
{
	int i = 0;
    uint8_t Asdata[4] = {0};
    uint8_t Brdata[4] = {0};
	
	//printf("test here \r\n");
	rs485net_task_stop();    


	/* 初始化发送数据 */
	for (i = 0; i < 4; i++)
	{
		Asdata[i] = 0x30 + i;
	}
	

	while(usart_recv_pre(EVAL_COM0, 4) < 0);
	while(usart_send(EVAL_COM1, (uint8_t *) Asdata, 4) < 0);	
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Asend_data[%d]: %d\n", i, Asdata[i]);
//	}
	
	while (usart_recv(EVAL_COM0, Brdata) < 0)
	{
		;
	}
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Brdata[%d]: %d\n", i, Brdata[i]);
//	}
	
	
	if(Brdata[0] != 0 || Brdata[1] != 0 || Brdata[2] != 0 || Brdata[3] != 0)
	{
		//printf("data and rdata are equal\n");
		return 1;
	} 
	else{
		//printf("data and rdata are not equal\n");
		return 0;
	}
	
}



int uart3_get_tmperature_data()
{
	int i = 0;
    uint8_t Asdata[4] = {0};
    uint8_t Brdata[4] = {0};
	
	
	//printf("test here \r\n");
	rs485net_task_stop();    

	/* 初始化发送数据 */
	for (i = 0; i < 4; i++)
	{
		Asdata[i] = 0x30 + i;
	}
	

	while(usart_recv_pre(EVAL_COM4, 4) < 0);
	while(usart_send(EVAL_COM3, (uint8_t *) Asdata, 4) < 0);	
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Asend_data[%d]: %d\n", i, Asdata[i]);
//	}
	
	while (usart_recv(EVAL_COM4, Brdata) < 0)
	{
		;
	}
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Brdata[%d]: %d\n", i, Brdata[i]);
//	}
	
	
	//if(memcmp(Asdata, Brdata, sizeof(Asdata)) == 0)
	if(Brdata[0] != 0 || Brdata[1] != 0 || Brdata[2] != 0 || Brdata[3] != 0)
	{
		//printf("data and rdata are equal\n");
		return 1;
	} 
	else{
		//printf("data and rdata are not equal\n");
		return 0;
	}
	
	
	//printf("test pass \r\n");
	//rs485net_task_start();
    		
}


int uart4_get_tmperature_data()
{
//	int i = 0;
    uint8_t Asdata[4] = {0x30, 0x31, 0x32, 0x33};
    uint8_t Brdata[4] = {0};
	
	
	//printf("test here \r\n");
	rs485net_task_stop();    

//	/* 初始化发送数据 */
//	for (i = 0; i < 4; i++)
//	{
//		Asdata[i] = 0x30 + i;
//	}
//	

