sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0426/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
	while(usart_recv_pre(EVAL_COM3, 4) < 0);
	while(usart_send(EVAL_COM4, (uint8_t *) Asdata, 4) < 0);	
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Asend_data[%d]: %d\n", i, Asdata[i]);
	
//	}
	
	//for(i = 0; i < 1000; i++)
	
	while (usart_recv(EVAL_COM3, Brdata) < 0)
	{
		;
	}
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("Brdata[%d]: %d\n", i, Brdata[i]);
//	}
	
	
	//if(memcmp(Asdata, Brdata, sizeof(Asdata)) == 0) 
	if(Brdata[0] != 0 || Brdata[1] != 0 || Brdata[2] != 0 || Brdata[3] != 0)
	{
		//printf("data and rdata are equal\n");
		return 1;
	} 
	else{
		//printf("data and rdata are not equal\n");
		return 0;
	}
    		
}

int get_tmperature_data()
{
	int i = 0;
	int equal = 1;
    uint8_t data[32] = {0};
    uint8_t rdata[32] = {0};
    
    //printf("test here \r\n");
	rs485net_task_stop();
    
	/* 初始化发送数据 */
	for (i = 0; i < 32; i++)
	{
		data[i] = 0x30 + i;
	}
	usart_recv_clear(EVAL_COM0);
	
	while(usart_recv_pre(EVAL_COM0, 4) < 0);
	Delay_ms(1);
	while(usart_send(EVAL_COM1, (uint8_t *) data, 4) < 0);
	Delay_ms(2);
	
	while (usart_recv(EVAL_COM0, rdata) < 0)
	{
	}

//	for(i = 0; i < 4; i++)
//	{
//		printf("send_data[%d]: %d\n", i, data[i]);
//	
//	}
	
//	for(i = 0; i < 4; i++)
//	{
//		printf("recv_data[%d]: %d\n", i, rdata[i]);
//	}
	
	for (i = 1; i < 4; i++) {
        if (data[i] != rdata[i]) {
            equal = 0;
            break;
        }
    }

    if (equal) {
        //printf("data and rdata are equal\n");
		return 1;
    } else {
       // printf("data and rdata are not equal\n");
		return 0;
    }
}

void set_camera_status()
{
	int i = 0;
	
	for(i = 0; i < 4; i ++){
		if(p_configuration_data->channel0.dh_channel){
			if(strcmp((char*)p_configuration_data->channel0.camera_id, "0")){ //"0" 改为摄像头id
				camera_status[0] = 0; // 0 改为摄像头数据
			}
		}
		if(p_configuration_data->channel1.dh_channel){
			if(strcmp((char*)p_configuration_data->channel1.camera_id, "0")){ //"0" 改为摄像头id
				camera_status[1] = 0; // 0 改为摄像头数据
			}
		}
		if(p_configuration_data->channel2.dh_channel){
			if(strcmp((char*)p_configuration_data->channel2.camera_id, "0")){ //"0" 改为摄像头id
				camera_status[2] = 0; // 0 改为摄像头数据
			}
		}
		if(p_configuration_data->channel3.dh_channel){
			if(strcmp((char*)p_configuration_data->channel3.camera_id, "0")){ //"0" 改为摄像头id
				camera_status[3] = 0; // 0 改为摄像头数据
			}
		}
	}
}

